app/controllers/todos_controller.rb

SELECT "todos".* FROM "todos"
---
  def index
    @todos = Todo.all

INSERT INTO "todos" ("created_at", "notes", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2015-11-11 19:47:56.768112"], ["notes", ""], ["title", ""], ["updated_at", "2015-11-11 19:47:56.768112"]]
---
  def create
    @todo = Todo.new(todo_params)

    respond_to do |format|
      if @todo.save

UPDATE "todos" SET "notes" = ?, "updated_at" = ? WHERE "todos"."id" = 2  [["notes", "Bring coupon to get discount"], ["updated_at", "2015-11-11 20:55:30.117880"]]
---
  def update
    respond_to do |format|
      if @todo.update(todo_params)

DELETE FROM "todos" WHERE "todos"."id" = ?  [["id", 6]]
---
  def destroy
    @todo.destroy

SELECT  "todos".* FROM "todos"  WHERE "todos"."id" = ? LIMIT 1  [["id", 6]]
---
    def set_todo
      @todo = Todo.find(params[:id])